print()
print('- - - - - - - - - - - - - - - - - - ')
print()

# -F- ------------------------------------------------------

def del_from_tuple(tpl, elem):                              # Функция удаления элемента из кортежа
    if elem in tpl:                                         # Проверка, присутствует ли элемент в кортеже
        elem_index = tpl.index(elem)                        # Извлечение индекса заданного элемента
        tpl = tpl[:elem_index] + tpl[elem_index + 1:]       # Создание нового кортежа без указанного элемента 
    return tpl                                              # Возврат получившегося кортежа

# -F- ------------------------------------------------------
# [ ] -------------------------------------------------->->->

print('Вариант 2')
tuple_2 = (1, 2, 3, 1, 2, 3, 4, 5, 2, 3, 4, 2, 4, 2)
element_2 = 3
print("Кортеж: ", tuple_2, ". Элемент: ", element_2)
# print("Кортеж без заданного элемента: ", del_from_tuple(tuple_2, element_2))
print("Кортеж:    ", del_from_tuple(tuple_2, element_2))
print()

# [ ] -------------------------------------------------<-<-<-
print()
print('- - - - - - - - - - - - - - - - - - ')
print()
