print()
print('- - - - - - - - - - - - - - - - - - ')
print('Задача 1.')
print('- - - - - - - - - - - - - - - - - - ')
print('--- Задан список слов из известной фразы: ---')
print('--- rainbow = ["каждый", "охотник", "желает", "знать", "где", "сидит", "фазан"] ---')
print('--- Ваша задача: используя данный список, вывести на экран фразу ---')
print('--- "каждый охотник желает знать где сидит фазан" в одну строчку. ---')
print('- - - - - - - - - - - - - - - - - - ')
print()

# -F- ------------------------------------------------------

# -F- ------------------------------------------------------
# [ ] -------------------------------------------------->->->

rainbow = ["каждый", "охотник", "желает", "знать", "где", "сидит", "фазан"]
# |--- -----------------------------------------------------
# 1.
print('   1.')
print(*rainbow)
# |--- -----------------------------------------------------
# 2.
print('   2.*')
for i in rainbow: 
    print(i, end = ' ')
print()
# |--- -----------------------------------------------------
# 3.
print('   3.*')
print(' '.join(rainbow))
# |--- -----------------------------------------------------
# [ ] -------------------------------------------------<-<-<-
print()
print('- - - - - - - - - - - - - - - - - - ')
print()
