# -F- ---divider--------------------------------------------
def divider(num):
    r = '- - -'
    print()
    for i in range(5): print(f'{r} {num}. ', end = '')
    print(f'{r}')
# -F- ---br-------------------------------------------------
def br(ch):
    print(f'{ch} ', end = '')
    for i in range(20): print(f'{ch} ', end = '')
    print(f'{ch}')
# -F- ---br_------------------------------------------------
def br_(ch):
    print(f'\n{ch} ', end = '')
    for i in range(50): print(f'{ch} ', end = '')
    print(f'{ch}\n')
# -F- ------------------------------------------------------

def del_from_tuple_1(tpl, elem):                            # Функция удаления элемента из кортежа
    if elem in tpl:                                         # Проверка, присутствует ли элемент в кортеже
        elem_index = tpl.index(elem)                        # Извлечение индекса заданного элемента
        tpl = tpl[:elem_index] + tpl[elem_index + 1:]       # Создание нового кортежа без указанного элемента 
    return tpl                                              # Возврат получившегося кортежа

# -F- ------------------------------------------------------

def del_from_tuple_2(tpl, elem):                            # Функция удаления элемента из кортежа
    lst = list(tpl)                                         # Преобразование кортежа в список
    if elem in tpl:                                         # Проверка, присутствует ли элемент в списке
        lst.remove(elem)                                    # Удаление элемента из списка
    return tuple(lst)                                       # Возврат обратно преобразованного в кортеж списка

# -F- ------------------------------------------------------
def del_from_tupleT(tpl, elem):
    if elem in tpl:
        elem_index = tpl.index(elem)
        print('-> Что происходит в функции ?: ->'.rjust(99, '-'))
        print('ДО иском. элем.:  ', end = '')
        print(tpl[:elem_index])
        print('Искомый элемент:     ', end = '')
        print(f'   ({tpl[elem_index]})   ')
        print('ПОСЛЕ иском. элем.:        ', end = '')
        print(tpl[elem_index + 1:])
        print('<- Что происходит в функции ?: <-'.rjust(99, '-'))
        tpl = tpl[:elem_index] + tpl[elem_index + 1:]
    return tpl
# -F- ------------------------------------------------------

br_('=')
print('Задача 3.')
br('-')
print('--- Вы уже знаете, что кортежи являются неизменяемыми, но как быть, если нам нужно удалить элемент кортежа? ---')
print('--- Создайте функцию:   \'del_from_tuple(tpl, elem)\', ---')
print('--- которая будет удалять первое появление определенного элемента (elem) из кортежа (tpl) ---')
print('--- и возвращать кортеж без него. ---')
print('--- Если в кортеже (tpl) нет указанного элемента (elem), ---')
print('--- то функция должна вернуть кортеж в исходном виде. ---')
br('-')


# [ ] -------------------------------------------------->->->
# |--- -----------------------------------------------------
divider(1)
br_("-")
print('Вариант 11.*')
tuple_1 = (1, 2, 3)
element_1 = 1
print("Кортеж: ", tuple_1, ". Элемент: ", element_1)
print("Кортеж без заданного элемента: ", del_from_tuple_1(tuple_1, element_1))
br_("-")
# |--- -----------------------------------------------------
print('Вариант 12.*')
tuple_2 = (1, 2, 3, 1, 2, 3, 4, 5, 2, 3, 4, 2, 4, 2)
element_2 = 3
print("Кортеж: ", tuple_2, ". Элемент: ", element_2)
print("Кортеж без заданного элемента: ", del_from_tuple_1(tuple_2, element_2))
br_("-")
# |--- -----------------------------------------------------
print('Вариант 13.*')
tuple_3 = (2, 4, 6, 6, 4, 2)
element_3 = 9
print("Кортеж: ", tuple_3, ". Элемент: ", element_3)
print("Кортеж без заданного элемента: ", del_from_tuple_1(tuple_3, element_3))
br_("-")
# |--- -----------------------------------------------------
print('Вариант 13 - !!! Разбор !!!')
element_3 = 6
print("Кортеж исходный: ", tuple_3, ". Элемент: ", element_3)
print("Кортеж финальный: ", del_from_tupleT(tuple_3, element_3))
br_("-")
divider(2)
br_("-")
# |--- -----------------------------------------------------
print('Вариант 21.*')
tuple_1 = (1, 2, 3)
element_1 = 1
print("Кортеж: ", tuple_1, ". Элемент: ", element_1)
print("Кортеж без заданного элемента: ", del_from_tuple_2(tuple_1, element_1))
br_("-")
# |--- -----------------------------------------------------
print('Вариант 22.*')
tuple_2 = (1, 2, 3, 1, 2, 3, 4, 5, 2, 3, 4, 2, 4, 2)
element_2 = 3
print("Кортеж: ", tuple_2, ". Элемент: ", element_2)
print("Кортеж без заданного элемента: ", del_from_tuple_2(tuple_2, element_2))
br_("-")
# |--- -----------------------------------------------------
print('Вариант 23.*')
tuple_3 = (2, 4, 6, 6, 4, 2)
element_3 = 9
print("Кортеж: ", tuple_3, ". Элемент: ", element_3)
print("Кортеж без заданного элемента: ", del_from_tuple_2(tuple_3, element_3))
br_("=")
# |--- -----------------------------------------------------
# [ ] -------------------------------------------------<-<-<-
