print()
print('- - - - - - - - - - - - - - - - - - ')
print('Задача 3.')
print('- - - - - - - - - - - - - - - - - - ')
print('--- Вы уже знаете, что кортежи являются неизменяемыми, но как быть, если нам нужно удалить элемент кортежа? ---')
print('--- Создайте функцию:   \'del_from_tuple(tpl, elem)\', ---')
print('--- которая будет удалять первое появление определенного элемента (elem) из кортежа (tpl) ---')
print('--- и возвращать кортеж без него. ---')
print('--- Если в кортеже (tpl) нет указанного элемента (elem), ---')
print('--- то функция должна вернуть кортеж в исходном виде. ---')
print('- - - - - - - - - - - - - - - - - - ')
print()

# -F- ------------------------------------------------------

def del_from_tuple(tpl, elem):                              # Функция удаления элемента из кортежа
    if elem in tpl:                                         # Проверка, присутствует ли элемент в кортеже
        elem_index = tpl.index(elem)                        # Извлечение индекса заданного элемента
        tpl = tpl[:elem_index] + tpl[elem_index + 1:]       # Создание нового кортежа без указанного элемента 
    return tpl                                              # Возврат получившегося кортежа

# -F- ------------------------------------------------------
# [ ] -------------------------------------------------->->->
# |--- -----------------------------------------------------
print('Вариант 1')
tuple_1 = (1, 2, 3)
element_1 = 1
print("Кортеж: ", tuple_1, ". Элемент: ", element_1)
print("Кортеж без заданного элемента: ", del_from_tuple(tuple_1, element_1))
print()
# |--- -----------------------------------------------------
print('Вариант 2')
tuple_2 = (1, 2, 3, 1, 2, 3, 4, 5, 2, 3, 4, 2, 4, 2)
element_2 = 3
print("Кортеж: ", tuple_2, ". Элемент: ", element_2)
print("Кортеж без заданного элемента: ", del_from_tuple(tuple_2, element_2))
print()
# |--- -----------------------------------------------------
print('Вариант 3')
tuple_3 = (2, 4, 6, 6, 4, 2)
element_3 = 9
print("Кортеж: ", tuple_3, ". Элемент: ", element_3)
print("Кортеж без заданного элемента: ", del_from_tuple(tuple_3, element_3))
# |--- -----------------------------------------------------
# [ ] -------------------------------------------------<-<-<-
print()
print('- - - - - - - - - - - - - - - - - - ')
print()
