# -F- ---divider--------------------------------------------
def divider(num):
    r = '- - -'
    print()
    for i in range(5): print(f'{r} {num}. ', end = '')
    print(f'{r}\n')
# -F- ---br-------------------------------------------------
def br(ch):
    print(f'{ch} ', end = '')
    for i in range(20): print(f'{ch} ', end = '')
    print(f'{ch}')
# -F- ---br_------------------------------------------------
def br_(ch):
    print(f'\n{ch} ', end = '')
    for i in range(50): print(f'{ch} ', end = '')
    print(f'{ch}\n')
# -F- ------------------------------------------------------

def count_element(list, elem):
    if elem in list:
        elem_index = list.index(elem)
        list = list[:elem_index]
    return len(list)

# -F- ------------------------------------------------------

br_('=')
print('Задача 4.')
br('-')
print('--- Дана текстовая фраза: ---')
print('--- phrase = "В чащах юга жил бы цитрус? Да, но фальшивый экземпляр!" ---')
print('--- Ваша задача: посчитать и вывести на экран количество символов (с учетом пробелов и знаков препинания) до буквы е. ---')
print('--- Подсказка: к символам строковой переменной можно обращаться так же, как к элементам списка. ---')
print('--- Ваш результат должен быть таким: ---')
print('--- \"Количество символов во фразе до буквы "е": 47\" ---')
# print('---  ---')
br('-')

# [ ] -------------------------------------------------->->->

phrase = "В чащах юга жил бы цитрус? Да, но фальшивый экземпляр!"
element = 'е'
br_('-')
# |--- -----------------------------------------------------
print('Вариант 1.')
print("Количество символов во фразе до буквы \"е\": ", count_element(phrase, element))
br_('-')
# |--- -----------------------------------------------------
print('Вариант 2.*')
sum_ = 0                                  # Счетчик суммы
for i in range(len(phrase)):              # Проход по всей фразе
    # Добавление к сумме 1, если символ не равен "е"
    if phrase[i] != 'е':                    
        sum_ += 1
    # Вывод результата и выход из цикла
    if phrase[i] == 'е':
        print('Количество символов во фразе до буквы "е": ', sum_)
        break
br_('-')
# |--- -----------------------------------------------------
print('Вариант 3.*')
print('Количество символов во фразе до буквы "е": ', phrase.find('е'))
br_("=")
# |--- -----------------------------------------------------
# [ ] -------------------------------------------------<-<-<-