# -F- ---divider--------------------------------------------
def divider(num):
    r = '- - -'
    print()
    for i in range(5): print(f'{r} {num}. ', end = '')
    print(f'{r}\n')
# -F- ---br-------------------------------------------------
def br(ch):
    print(f'{ch} ', end = '')
    for i in range(20): print(f'{ch} ', end = '')
    print(f'{ch}')
# -F- ---br_------------------------------------------------
def br_(ch):
    print(f'\n{ch} ', end = '')
    for i in range(50): print(f'{ch} ', end = '')
    print(f'{ch}\n')
# -F- ------------------------------------------------------

# -F- ------------------------------------------------------
def to_list1(*args):
    print (list(args))
# -F- ------------------------------------------------------
# Переменная args, обозначающая неограниченное количество неименованных 
# параметров, представлена внутри любой функции в виде кортежа.
def to_list2(*args):                    # Функция, принимающая неограниченное количество элементов
    return list(args)                   # Преобразование кортежа параметров в список
# -F- ------------------------------------------------------

br_('='); print('Задача 5.'); br('-')

print('--- Создайте функцию to_list(), которая принимает неограниченное количество параметров. ---')
print('--- Обработайте их так, чтобы на выходе получить список из этих элементов. ---')

br('-')

# [ ] -------------------------------------------------->->->

t1 = (1, 2, 3)
t2 = ('Молоко', 5, '2020 год')
t3 = ([3, 4, 7], 8.3, True, 'Строка')

# |--- -----------------------------------------------------
br_('-')
print(' Вариант 1: '.center(50, '-'))
print(f'\nКортеж аргументов:   {t1}')
print('Список элементов:   ', end = ''); to_list1(t1)
print(f'\nКортеж аргументов:   {t2}')
print('Список элементов:   ', end = ''); to_list1(t2)
print(f'\nКортеж аргументов:   {t3}')
print('Список элементов:   ', end = ''); to_list1(t3)
print(f'\nКортеж аргументов:   {t1}, {t2}, {t3}')
print('Список элементов:   ', end = ''); to_list1(t1, t2, t3)
# |--- -----------------------------------------------------
br_('-')
print(' Вариант 2: '.center(50, '-'))
print(f'\nКортеж аргументов:   {t1}')
print(f'Список элементов:   {to_list2(t1)}')
print(f'Список элементов:  ', to_list2(t1))
print(f'\nКортеж аргументов:   {t2}')
print(f'Список элементов:   {to_list2(t2)}')
print(f'Список элементов:  ', to_list2(t2))
print(f'\nКортеж аргументов:   {t3}')
print(f'Список элементов:   {to_list2(t3)}')
print(f'Список элементов:  ', to_list2(t3))
print(f'\nКортеж аргументов:   {t1}, {t2}, {t3}')
print(f'Список элементов:   {to_list2(t1, t2, t3)}')
print(f'Список элементов:  ', to_list2(t1, t2, t3))
# |--- -----------------------------------------------------
br_("=")
# [ ] -------------------------------------------------<-<-<-
